In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('heights.csv')
df

    name  grade  height
0   Adam      1    31.7
1   Beth      1    74.9
2  Chris     12    72.3
3   Dana     12    61.8

In [3]:
max_heights = pd.DataFrame([
[1, 32],
], columns=['grade', 'max_height'])
max_heights

   grade  max_height
0      1          32

In [4]:
mdf = pd.merge(df, max_heights, how='left')
mdf

    name  grade  height  max_height
0   Adam      1    31.7        32.0
1   Beth      1    74.9        32.0
2  Chris     12    72.3         NaN
3   Dana     12    61.8         NaN

In [5]:
df[mdf['height'] > mdf['max_height']]

   name  grade  height
1  Beth      1    74.9